/*
https://www.e-olymp.com/uk/problems/20

Скільки можна?

Дано натуральне число n. Від даного числа віднімемо суму цифр цього числа, 
від утвореного числа знову віднімемо суму цифр утвореного числа і т. д. 
Дану операцію над числом будемо виконувати, поки утворене число додатне.
Скільки разів будемо виконувати дану операцію.

Вхідні дані

Одне натуральне число n, що не перевищує 2 *109.

Вихідні дані

Кількість виконаних операцій.

Ліміт часу 2 секунд
Ліміт використання пам'яті 64 MiB
Вхідні дані #1
21
Вихідні дані #1
3

*/

#include <stdio.h>

int sum(int n) {
    int res = 0;
    while(n > 0) {
        res = res + (n % 10);
        n = n / 10;
    }

    return res;
}

int main() {
    int n, res = 0;
    scanf("%d", &n);

    while(n > 0) {
        n = n - sum(n);
        res++;
    }

    printf("%d", res);

    return 0;
}
